In [40]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.impute import SimpleImputer

In [2]:
df=pd.read_csv('unclean_data.csv')

In [3]:
df

        ID Age  Gender Height (cm) Weight (kg) Income ($) Education Level
0     3887  21     NaN         187          71        NaN      Bachelor's
1    93906  37     NaN         172          47        NaN             NaN
2     4179  24  Female         146         106        NaN             NaN
3    33794  31     NaN         190          66      74043      Bachelor's
4    52309  74  Female         181          60      82046             NaN
..     ...  ..     ...         ...         ...        ...             ...
995  98674  48     NaN         192         127      14709             NaN
996  37733  69    Male         168         114        NaN             NaN
997   7064  90    Male         195       Heavy        NaN        Master's
998  51200  64  Female         153          82      89681     High School
999  85292  30  Female         164          89        NaN        Master's

[1000 rows x 7 columns]

In [11]:
def clean_age(age):
    age_str = str(age)
    
    if age_str.isdigit():
        return age
    else:
        return None
df['Age'] = df['Age'].apply(clean_age)

In [16]:
df['Age'] = pd.to_numeric(df['Age'], errors='coerce')

average_age = df['Age'].mean()

df['Age'] = df['Age'].fillna(average_age)

print(df)

        ID   Age  Gender Height (cm) Weight (kg) Income ($) Education Level
0     3887  21.0     NaN         187          71        NaN      Bachelor's
1    93906  37.0     NaN         172          47        NaN             NaN
2     4179  24.0  Female         146         106        NaN             NaN
3    33794  31.0     NaN         190          66      74043      Bachelor's
4    52309  74.0  Female         181          60      82046             NaN
..     ...   ...     ...         ...         ...        ...             ...
995  98674  48.0     NaN         192         127      14709             NaN
996  37733  69.0    Male         168         114        NaN             NaN
997   7064  90.0    Male         195       Heavy        NaN        Master's
998  51200  64.0  Female         153          82      89681     High School
999  85292  30.0  Female         164          89        NaN        Master's

[1000 rows x 7 columns]

In [30]:
pd.set_option('display.max_rows', 85)
pd.set_option('display.max_columns', None)
df

        ID   Age  Gender Height (cm) Weight (kg) Income ($) Education Level
0     3887  21.0     NaN         187          71        NaN      Bachelor's
1    93906  37.0     NaN         172          47        NaN             NaN
2     4179  24.0  Female         146         106        NaN             NaN
3    33794  31.0     NaN         190          66      74043      Bachelor's
4    52309  74.0  Female         181          60      82046             NaN
..     ...   ...     ...         ...         ...        ...             ...
995  98674  48.0     NaN         192         127      14709             NaN
996  37733  69.0    Male         168         114        NaN             NaN
997   7064  90.0    Male         195       Heavy        NaN        Master's
998  51200  64.0  Female         153          82      89681     High School
999  85292  30.0  Female         164          89        NaN        Master's

[1000 rows x 7 columns]

In [42]:
df['Height (cm)'] = pd.to_numeric(df['Height (cm)'], errors='coerce')

average_height = df['Height (cm)'].mean()

df['Height (cm)'] = df['Height (cm)'].fillna(average_height)

print(df)

        ID   Age  Gender  Height (cm) Weight (kg) Income ($) Education Level
0     3887  21.0     NaN        187.0          71        NaN      Bachelor's
1    93906  37.0     NaN        172.0          47        NaN             NaN
2     4179  24.0  Female        146.0         106        NaN             NaN
3    33794  31.0     NaN        190.0          66      74043      Bachelor's
4    52309  74.0  Female        181.0          60      82046             NaN
..     ...   ...     ...          ...         ...        ...             ...
995  98674  48.0     NaN        192.0         127      14709             NaN
996  37733  69.0    Male        168.0         114        NaN             NaN
997   7064  90.0    Male        195.0       Heavy        NaN        Master's
998  51200  64.0  Female        153.0          82      89681     High School
999  85292  30.0  Female        164.0          89        NaN        Master's

[1000 rows x 7 columns]

In [43]:
df['Weight (kg)'] = pd.to_numeric(df['Weight (kg)'], errors='coerce')

average_height = df['Weight (kg)'].mean()

df['Weight (kg)'] = df['Weight (kg)'].fillna(average_height)

print(df)

        ID   Age  Gender  Height (cm)  Weight (kg) Income ($) Education Level
0     3887  21.0     NaN        187.0    71.000000        NaN      Bachelor's
1    93906  37.0     NaN        172.0    47.000000        NaN             NaN
2     4179  24.0  Female        146.0   106.000000        NaN             NaN
3    33794  31.0     NaN        190.0    66.000000      74043      Bachelor's
4    52309  74.0  Female        181.0    60.000000      82046             NaN
..     ...   ...     ...          ...          ...        ...             ...
995  98674  48.0     NaN        192.0   127.000000      14709             NaN
996  37733  69.0    Male        168.0   114.000000        NaN             NaN
997   7064  90.0    Male        195.0    94.621457        NaN        Master's
998  51200  64.0  Female        153.0    82.000000      89681     High School
999  85292  30.0  Female        164.0    89.000000        NaN        Master's

[1000 rows x 7 columns]

In [57]:
df['Income ($)'] = pd.to_numeric(df['Income ($)'], errors='coerce')

average_height = df['Income ($)'].mean()

df['Income ($)'] = df['Income ($)'].fillna(average_height)

print(df)

        ID  Gender    Income ($) Education Level   Age  Height (cm)  \
0     3887     NaN  50292.895082      Bachelor's  21.0        187.0
1    93906     NaN  50292.895082             NaN  37.0        172.0
2     4179  Female  50292.895082             NaN  24.0        146.0
3    33794     NaN  74043.000000      Bachelor's  31.0        190.0
4    52309  Female  82046.000000             NaN  74.0        181.0
..     ...     ...           ...             ...   ...          ...
995  98674     NaN  14709.000000             NaN  48.0        192.0
996  37733    Male  50292.895082             NaN  69.0        168.0
997   7064    Male  50292.895082        Master's  90.0        195.0
998  51200  Female  89681.000000     High School  64.0        153.0
999  85292  Female  50292.895082        Master's  30.0        164.0

     Weight (kg)
0      71.000000
1      47.000000
2     106.000000
3      66.000000
4      60.000000
..           ...
995   127.000000
996   114.000000
997    94.621457
998    82.000000
999    89.000000

[1000 rows x 7 columns]

In [34]:
df['Age'].head(200)

0      21.0
1      37.0
2      24.0
3      31.0
4      74.0
       ...
195    82.0
196    83.0
197    69.0
198    34.0
199    18.0
Name: Age, Length: 200, dtype: float64

In [19]:
filt=(df['Age']==None)
df.loc[filt]

Empty DataFrame
Columns: [ID, Age, Gender, Height (cm), Weight (kg), Income ($), Education Level]
Index: []

In [45]:
df.select_dtypes(include="float").columns

Index(['Age', 'Height (cm)', 'Weight (kg)'], dtype='object')

In [71]:
si=SimpleImputer(strategy="mean")
ar=si.fit_transform(df[['Height (cm)', 'Weight (kg)']])

In [73]:
df_=pd.DataFrame(ar,columns=df[['Height (cm)', 'Weight (kg)']].columns)
df = pd.concat([df.drop(columns=['Height (cm)', 'Weight (kg)']), df_], axis=1)

In [74]:
df['Gender'].fillna(df['Gender'].mode()[0],inplace=True)

In [75]:
df['Education Level'].fillna(df['Education Level'].mode()[0],inplace=True)

In [66]:
df['Education Level'].value_counts()

Education Level
PhD             519
Master's        172
High School     170
Bachelor's      134
Graduate          3
Non-graduate      2
Name: count, dtype: int64

In [76]:
df.isnull().sum()

ID                 0
Gender             0
Education Level    0
Income ($)         0
Age                0
Height (cm)        0
Weight (kg)        0
dtype: int64

In [69]:
df.to_csv('cleaned_data.csv')